import FAQ from './components/FAQ'

export const dynamic = 'force-dynamic'
const faqs = [
  {
    id: '1',
    question: ' قهوه مورد استفاده شما از چه نوعی است و منشأ آن کجاست؟',
    answer:
      'تمامی محصولات ما از قهوه طبیعی گاو با بالاترین کیفیت و منشأ ایرانی (دباغی‌های معتبر اصفهان و تبریز) تهیه می‌شود. ما از قهوه‌های مصنوعی (پلاستیکی) استفاده نمی‌کنیم.',
  },
  {
    id: '2',
    question: 'چگونه از طبیعی و اصل بودن قهوه مطمئن شوم؟',
    answer:
      'قهوه طبیعی دارای رگه‌ها، بافت و بوئی منحصر به فرد است که در قهوه مصنوعی وجود ندارد. با گذشت زمان و استفاده، قهوه طبیعی نرم‌تر و زیباتر می‌شود و پاتینا (جلای کهنه‌گی) می‌گیرد.',
  },
  {
    id: '3',
    question: 'آیا رنگ قهوه ثابت است و روی لباس نمی‌ریزد؟',
    answer:
      'بله. از رنگ‌های باکیفیت و ثابت‌کننده‌های حرفه‌ای استفاده می‌کنیم. اما برای اطمینان بیشتر در اولین استفاده، توصیه می‌کنیم آن را با یک پارچه سفید و مرطوب به آرامی تماس دهید تا باقی‌مانده رنگ احتمالی پاک شود.',
  },
  {
    id: '4',
    question: ' آیا محصولات شما کاملاً دست‌ساز هستند؟',
    answer:
      'بله، تمام مراحل برش، دوخت (با دست یا چرخ خیاطی صنعتی)، رنگ‌آمیزی و پرداخت توسط هنرمندان ما به صورت دستی انجام می‌گیرد. این باعث می‌شود هر محصول منحصر به فرد و دارای هویتی خاص باشد',
  },
  {
    id: '5',
    question: 'چگونه می‌توانم اندازه صحیح کیف خود را انتخاب کنم؟',
    answer:
      'در صفحه هر محصول، یک راهنمای اندازه‌گیری دقیق (بر حسب سانتیمتر) قرار داده شده است. لطفاً قبل از خرید، با استفاده از یک خطکش یا متر، اندازه مورد نیاز خود را مطابق با راهنما کنترل کنید.',
  },
  {
    id: '6',
    question: 'چگونه از محصولات قهوهی خود نگهداری کنم؟',
    answer:
      '    از تماس طولانی‌مدت با آب و نور مستقیم خورشید خودداری کنید. برای تمیز کردن از یک پارچه نرم و خشک استفاده کنید. هر ۶ تا ۱۲ ماه یکبار با استفاده از مغز قهوه (Leather Conditioner) محصول خود را تغذیه کنید تا نرمی و انعطاف آن حفظ شود. هنگامی که از محصول استفاده نمی‌کنید، آن را درون کیسه پارچه‌ای خود (دماری) قرار داده و در جای خشک و خنک نگهداری کنید.',
  },
]
const FaqPage = () => {
  return (
    <section className="w-full overflow-hidden py-16 ">
      <FAQ faqs={faqs} />
    </section>
  )
}

export default FaqPage
